team/case8/V_dbl/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
23567
(
(9.84727 0.0276508 0)
(9.70306 0.0387261 0)
(9.55593 0.0470385 0)
(9.35902 0.0506876 0)
(9.15813 0.0508302 0)
(9.01533 0.0502433 0)
(8.87475 0.0493097 0)
(8.66271 0.0469026 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
41
(
(10 0 0)
(10 0 0)
(10 0 0)
(10 0 0)
(10 0 0)
(10 0 0)
(10 0 0)
(10 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
