team/case8/V_dbl/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
23567
(
0.663549
0.792902
0.908662
1.02302
1.09403
1.13005
1.15798
1.17704
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
41
(
0.375
0.375
0.375
0.375
0.375
0.375
0.375
0.375
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
314
(
0.509372
0.577136
0.640967
0.713123
0.770805
0.806702
0.839329
0.878582
...
)
;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
351
(
0.663549
0.792902
0.908662
1.02302
1.09403
1.13005
1.15798
1.17704
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
