team/case8/V_dbl/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23567
(
6.48939e-06
7.81931e-06
9.02749e-06
1.02724e-05
1.11198e-05
1.15867e-05
1.19756e-05
1.23405e-05
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
41
(
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
78
(
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
...
)
;
    }
    upperWall
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
314
(
0
0
0
0
0
0
0
0
...
)
;
    }
    lowerWall
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
351
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
