team/case8/V_dbl/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23567
(
39968.7
41241.8
42369.2
43448.9
44102.8
44432
44685.6
44857.5
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
41
(
314.4
314.4
314.4
314.4
314.4
314.4
314.4
314.4
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
314
(
21518.1
22132.3
22704.2
23332.4
23819.7
24118.9
24388.5
24707.9
...
)
;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
351
(
39968.7
41241.8
42369.2
43448.9
44102.8
44432
44685.6
44857.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
